# CannotFindClosest Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..CannotFindClosest Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Cannot find closest points within lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotFindClosest { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotFindClosest As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotFindClosest {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace